app/controllers/educations_controller.rb

    def new
        current_user.profile.educations.create
---
INSERT INTO "educations" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 4], ["created_at", "2022-01-08 09:04:31.297900"], ["updated_at", "2022-01-08 09:04:31.297900"]]