app/controllers/profiles_controller.rb

    def update
        updated_profile_params = update_array_attributes_in_params(profile_params)
        @profile = Profile.find(params[:id])
        if @profile.update(updated_profile_params) && @profile.save
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "profiles" SET "name" = $1, "job_title" = $2, "total_experience" = $3, "career_highlights" = $4, "overview" = $5, "updated_at" = $6 WHERE "profiles"."id" = $7  [["name", "Pqrs"], ["job_title", "Web Develpoer"], ["total_experience", "9"], ["career_highlights", "{jjjj}"], ["overview", "uuuu"], ["updated_at", "2022-01-09 19:04:16.077902"], ["id", 14]]

    def correct_user
        @profile = Profile.find(params[:id])
        @user = User.find(@profile.user_id)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]