app/controllers/users_controller.rb

      def create
        @user = User.new(user_params)

        # store all emails in lowercase to avoid duplicates and case-sensitive login errors:
        @user.email.downcase

        if @user.save
          # If user saves in the db successfully:
          @user.profile = Profile.new
          @user.profile.educations.create
          @user.profile.projects.create
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 7], ["created_at", "2022-01-09 19:03:27.139147"], ["updated_at", "2022-01-09 19:03:27.139147"]]
INSERT INTO "educations" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 14], ["created_at", "2022-01-09 19:03:27.241984"], ["updated_at", "2022-01-09 19:03:27.241984"]]
INSERT INTO "projects" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 15], ["created_at", "2022-01-11 12:47:48.018399"], ["updated_at", "2022-01-11 12:47:48.018399"]]